benchmarks/sharded.txt
====== SET ======
  1000000 requests completed in 28.35 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 2.903 milliseconds (cumulative count 1)
50.000% <= 14.023 milliseconds (cumulative count 500759)
75.000% <= 15.551 milliseconds (cumulative count 750763)
87.500% <= 16.847 milliseconds (cumulative count 875918)
93.750% <= 18.223 milliseconds (cumulative count 937838)
96.875% <= 19.663 milliseconds (cumulative count 968889)
98.438% <= 21.487 milliseconds (cumulative count 984382)
99.219% <= 23.583 milliseconds (cumulative count 992208)
99.609% <= 26.527 milliseconds (cumulative count 996096)
99.805% <= 31.455 milliseconds (cumulative count 998051)
99.902% <= 37.631 milliseconds (cumulative count 999026)
99.951% <= 44.415 milliseconds (cumulative count 999513)
99.976% <= 47.583 milliseconds (cumulative count 999764)
99.988% <= 48.735 milliseconds (cumulative count 999880)
99.994% <= 49.663 milliseconds (cumulative count 999940)
99.997% <= 54.399 milliseconds (cumulative count 999970)
99.998% <= 55.231 milliseconds (cumulative count 999985)
99.999% <= 55.551 milliseconds (cumulative count 999993)
100.000% <= 55.679 milliseconds (cumulative count 999998)
100.000% <= 55.711 milliseconds (cumulative count 999999)
100.000% <= 66.687 milliseconds (cumulative count 1000000)
100.000% <= 66.687 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.001% <= 3.103 milliseconds (cumulative count 8)
0.003% <= 4.103 milliseconds (cumulative count 34)
0.005% <= 5.103 milliseconds (cumulative count 46)
0.037% <= 6.103 milliseconds (cumulative count 374)
0.088% <= 7.103 milliseconds (cumulative count 876)
0.155% <= 8.103 milliseconds (cumulative count 1549)
0.554% <= 9.103 milliseconds (cumulative count 5538)
2.396% <= 10.103 milliseconds (cumulative count 23959)
7.498% <= 11.103 milliseconds (cumulative count 74979)
17.516% <= 12.103 milliseconds (cumulative count 175160)
32.967% <= 13.103 milliseconds (cumulative count 329674)
51.575% <= 14.103 milliseconds (cumulative count 515745)
68.933% <= 15.103 milliseconds (cumulative count 689330)
81.353% <= 16.103 milliseconds (cumulative count 813527)
89.174% <= 17.103 milliseconds (cumulative count 891745)
93.438% <= 18.111 milliseconds (cumulative count 934376)
96.018% <= 19.103 milliseconds (cumulative count 960181)
97.428% <= 20.111 milliseconds (cumulative count 974276)
98.237% <= 21.103 milliseconds (cumulative count 982370)
98.743% <= 22.111 milliseconds (cumulative count 987429)
99.091% <= 23.103 milliseconds (cumulative count 990915)
99.340% <= 24.111 milliseconds (cumulative count 993399)
99.509% <= 25.103 milliseconds (cumulative count 995086)
99.587% <= 26.111 milliseconds (cumulative count 995870)
99.644% <= 27.103 milliseconds (cumulative count 996439)
99.707% <= 28.111 milliseconds (cumulative count 997074)
99.747% <= 29.103 milliseconds (cumulative count 997474)
99.766% <= 30.111 milliseconds (cumulative count 997662)
99.799% <= 31.103 milliseconds (cumulative count 997988)
99.815% <= 32.111 milliseconds (cumulative count 998149)
99.842% <= 33.119 milliseconds (cumulative count 998415)
99.858% <= 34.111 milliseconds (cumulative count 998577)
99.870% <= 35.103 milliseconds (cumulative count 998702)
99.889% <= 36.127 milliseconds (cumulative count 998888)
99.891% <= 37.119 milliseconds (cumulative count 998907)
99.912% <= 38.111 milliseconds (cumulative count 999115)
99.913% <= 39.103 milliseconds (cumulative count 999130)
99.936% <= 40.127 milliseconds (cumulative count 999355)
99.938% <= 41.119 milliseconds (cumulative count 999384)
99.940% <= 42.111 milliseconds (cumulative count 999399)
99.941% <= 43.103 milliseconds (cumulative count 999410)
99.948% <= 44.127 milliseconds (cumulative count 999484)
99.960% <= 45.119 milliseconds (cumulative count 999600)
99.963% <= 46.111 milliseconds (cumulative count 999630)
99.969% <= 47.103 milliseconds (cumulative count 999694)
99.982% <= 48.127 milliseconds (cumulative count 999819)
99.990% <= 49.119 milliseconds (cumulative count 999903)
99.995% <= 50.111 milliseconds (cumulative count 999945)
99.997% <= 51.103 milliseconds (cumulative count 999966)
99.997% <= 54.111 milliseconds (cumulative count 999967)
99.998% <= 55.103 milliseconds (cumulative count 999983)
100.000% <= 56.127 milliseconds (cumulative count 999999)
100.000% <= 67.135 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 35267.15 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
       14.297     2.896    14.023    18.655    22.847    66.687
====== GET ======
  1000000 requests completed in 29.91 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 4.255 milliseconds (cumulative count 1)
50.000% <= 14.431 milliseconds (cumulative count 500987)
75.000% <= 16.103 milliseconds (cumulative count 750608)
87.500% <= 17.775 milliseconds (cumulative count 875157)
93.750% <= 20.351 milliseconds (cumulative count 937599)
96.875% <= 24.031 milliseconds (cumulative count 968804)
98.438% <= 27.263 milliseconds (cumulative count 984407)
99.219% <= 30.799 milliseconds (cumulative count 992196)
99.609% <= 34.687 milliseconds (cumulative count 996113)
99.805% <= 41.215 milliseconds (cumulative count 998061)
99.902% <= 43.263 milliseconds (cumulative count 999027)
99.951% <= 46.335 milliseconds (cumulative count 999520)
99.976% <= 48.831 milliseconds (cumulative count 999769)
99.988% <= 50.303 milliseconds (cumulative count 999882)
99.994% <= 50.783 milliseconds (cumulative count 999939)
99.997% <= 51.455 milliseconds (cumulative count 999970)
99.998% <= 52.543 milliseconds (cumulative count 999987)
99.999% <= 53.055 milliseconds (cumulative count 999993)
100.000% <= 55.391 milliseconds (cumulative count 999997)
100.000% <= 56.511 milliseconds (cumulative count 999999)
100.000% <= 56.671 milliseconds (cumulative count 1000000)
100.000% <= 56.671 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.005% <= 5.103 milliseconds (cumulative count 49)
0.013% <= 6.103 milliseconds (cumulative count 130)
0.049% <= 7.103 milliseconds (cumulative count 489)
0.131% <= 8.103 milliseconds (cumulative count 1313)
0.307% <= 9.103 milliseconds (cumulative count 3068)
1.103% <= 10.103 milliseconds (cumulative count 11035)
4.322% <= 11.103 milliseconds (cumulative count 43223)
12.618% <= 12.103 milliseconds (cumulative count 126184)
26.129% <= 13.103 milliseconds (cumulative count 261289)
44.069% <= 14.103 milliseconds (cumulative count 440688)
61.675% <= 15.103 milliseconds (cumulative count 616754)
75.061% <= 16.103 milliseconds (cumulative count 750608)
83.801% <= 17.103 milliseconds (cumulative count 838008)
88.948% <= 18.111 milliseconds (cumulative count 889484)
91.778% <= 19.103 milliseconds (cumulative count 917778)
93.421% <= 20.111 milliseconds (cumulative count 934210)
94.648% <= 21.103 milliseconds (cumulative count 946483)
95.492% <= 22.111 milliseconds (cumulative count 954917)
96.193% <= 23.103 milliseconds (cumulative count 961926)
96.947% <= 24.111 milliseconds (cumulative count 969471)
97.513% <= 25.103 milliseconds (cumulative count 975125)
97.929% <= 26.111 milliseconds (cumulative count 979287)
98.378% <= 27.103 milliseconds (cumulative count 983779)
98.692% <= 28.111 milliseconds (cumulative count 986917)
98.916% <= 29.103 milliseconds (cumulative count 989159)
99.093% <= 30.111 milliseconds (cumulative count 990933)
99.263% <= 31.103 milliseconds (cumulative count 992634)
99.360% <= 32.111 milliseconds (cumulative count 993599)
99.469% <= 33.119 milliseconds (cumulative count 994688)
99.551% <= 34.111 milliseconds (cumulative count 995506)
99.639% <= 35.103 milliseconds (cumulative count 996386)
99.674% <= 36.127 milliseconds (cumulative count 996744)
99.684% <= 37.119 milliseconds (cumulative count 996844)
99.696% <= 38.111 milliseconds (cumulative count 996963)
99.726% <= 39.103 milliseconds (cumulative count 997260)
99.764% <= 40.127 milliseconds (cumulative count 997637)
99.802% <= 41.119 milliseconds (cumulative count 998018)
99.859% <= 42.111 milliseconds (cumulative count 998588)
99.898% <= 43.103 milliseconds (cumulative count 998977)
99.919% <= 44.127 milliseconds (cumulative count 999193)
99.933% <= 45.119 milliseconds (cumulative count 999331)
99.947% <= 46.111 milliseconds (cumulative count 999465)
99.958% <= 47.103 milliseconds (cumulative count 999580)
99.965% <= 48.127 milliseconds (cumulative count 999650)
99.981% <= 49.119 milliseconds (cumulative count 999807)
99.986% <= 50.111 milliseconds (cumulative count 999858)
99.996% <= 51.103 milliseconds (cumulative count 999965)
99.997% <= 52.127 milliseconds (cumulative count 999970)
99.999% <= 53.119 milliseconds (cumulative count 999994)
100.000% <= 54.111 milliseconds (cumulative count 999996)
100.000% <= 56.127 milliseconds (cumulative count 999998)
100.000% <= 57.119 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 33430.28 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
       15.082     4.248    14.431    21.471    29.647    56.671